olliw42/stm32ll-lib/src/stdstm32-uartc.h
#endif // defined UARTC_USE_RX || defined UARTC_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UARTC_USE_TX

uint16_t uartc_putc(char c)
{
#ifndef UARTC_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UARTC_UARTx)) {}
  LL_USART_TransmitData8(UARTC_UARTx, c);
  return 1;
#else
  uint16_t next = (uartc_txwritepos + 1) & UARTC_TXBUFSIZEMASK;
  if (uartc_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uartc_txbuf[next] = c;
    uartc_txwritepos = next;
    LL_USART_EnableIT_TXE(UARTC_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


void uartc_puts(const char *s)
{
  while (*s) {
    uartc_putc(*s);
    s++;
  }
}


void uartc_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uartc_putc(buf[i]);
}


#ifdef UARTC_USE_TX_ISR
uint16_t uartc_tx_notfull(void)
{
  uint16_t next = (uartc_txwritepos + 1) & UARTC_TXBUFSIZEMASK;
  return (uartc_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uartc_tx_isempty(void)
{
  if (uartc_txwritepos == uartc_txreadpos) return 1;
  return 0;
}


static inline void uartc_tx_flush(void)
{
  uartc_txwritepos = uartc_txreadpos = 0;
}
#else
static inline void uartc_tx_flush(void) {}
#endif

#endif // defined UARTC_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTC_USE_RX

static inline uint16_t uartc_rx_available(void)
{
  if (uartc_rxwritepos == uartc_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uartc_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uartc_rxwritepos - (int16_t)uartc_rxreadpos;
  return (d < 0) ? d + (UARTC_RXBUFSIZEMASK + 1) : d;
}


char uartc_getc(void)
{
  while (uartc_rxwritepos == uartc_rxreadpos) {};
  uartc_rxreadpos = (uartc_rxreadpos + 1) & UARTC_RXBUFSIZEMASK;
  return uartc_rxbuf[uartc_rxreadpos];
}


static inline char uartc_lookatnextc(void)
{
  return uartc_rxbuf[(uartc_rxreadpos + 1) & UARTC_RXBUFSIZEMASK];
}


static inline void uartc_rx_flush(void)
{
  uartc_rxwritepos = uartc_rxreadpos = 0;
}

#endif // defined UARTC_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------
// ATTENTION:
// LPUART does not support 0.5 or 1.5 stop bits !!

// helper, usually should not be called itself
void _uartc_initprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTC_USE_LPUART1 || defined UARTC_USE_LPUART1_PA2PA3 || defined UARTC_USE_LPUART1_PC1PC0)
LL_USART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != XUART_PARITY_NO) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  UART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4
  UART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif

  LL_USART_Init(UARTC_UARTx, &UART_InitStruct);
#else
LL_LPUART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_LPUART_DATAWIDTH_9B : LL_LPUART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  UART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;

  LL_LPUART_Init(UARTC_UARTx, &UART_InitStruct);
#endif
}


void uartc_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTC_USE_LPUART1 || defined UARTC_USE_LPUART1_PA2PA3 || defined UARTC_USE_LPUART1_PC1PC0)
  LL_USART_Disable(UARTC_UARTx); // must be disabled to configure some registers
  _uartc_initprotocol(baud, parity, stopbits);
  LL_USART_Enable(UARTC_UARTx);
#else
  LL_LPUART_Disable(UARTC_UARTx); // must be disabled to configure some registers
  _uartc_initprotocol(baud, parity, stopbits);
  LL_LPUART_Enable(UARTC_UARTx);
#endif
}


void uartc_setbaudrate(uint32_t baud)
{
  uartc_setprotocol(baud, XUART_PARITY_NO, UART_STOPBIT_1);
}


void uartc_tx_enablepin(FunctionalState flag)
{
#ifdef UARTC_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UARTC_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTC_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UARTC_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}


void uartc_rx_enableisr(FunctionalState flag)
{
#ifdef UARTC_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTC_UARTx);
#endif
    LL_USART_ReceiveData8(UARTC_UARTx); // read DR to clear RXNE and error flags
    LL_USART_EnableIT_RXNE(UARTC_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UARTC_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTC_UARTx);
#endif
  }
#endif
}


void uartc_init_isroff(void)
{
  LL_USART_Disable(UARTC_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UARTC_UARTx);
#ifdef STM32F1
#if defined UARTC_USE_UART1_PB6PB7
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UARTC_USE_UART2_PD5PD6
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UARTC_USE_UART3_PC10PC11
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif // STM32F1

  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UARTC_USE_TX
  gpio_init_af(UARTC_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTC_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UARTC_USE_RX
#ifndef UARTC_INVERTED
  gpio_init_af(UARTC_RX_IO, IO_MODE_INPUT_PU, UARTC_IO_AF, IO_SPEED_VERYFAST);
#else
  gpio_init_af(UARTC_RX_IO, IO_MODE_INPUT_PD, UARTC_IO_AF, IO_SPEED_VERYFAST);
#endif
#endif

  // Configure USART/LPUART
  _uartc_initprotocol(UARTC_BAUD, XUART_PARITY_NO, UART_STOPBIT_1);
#if !(defined UARTC_USE_LPUART1 || defined UARTC_USE_LPUART1_PA2PA3 || defined UARTC_USE_LPUART1_PC1PC0)
  LL_USART_ConfigAsyncMode(UARTC_UARTx);
#if defined STM32G4
  LL_USART_DisableFIFO(UARTC_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTC_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTC_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#endif
#else
  LL_LPUART_DisableFIFO(UARTC_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UARTC_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UARTC_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

#ifdef UARTC_INVERTED
#ifdef UARTC_USE_TX
  LL_USART_SetTXPinLevel(UARTC_UARTx, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef UARTC_USE_RX
  LL_USART_SetRXPinLevel(UARTC_UARTx, LL_USART_RXPIN_LEVEL_INVERTED);
#endif
#endif

  // Configure NVIC channel
#if defined UARTC_USE_RX || defined UARTC_USE_TX_ISR
#ifdef UARTC_PREEMPTIONPRIORITY
  #error Legacy UARTC_PREEMPTIONPRIORITY used !
#endif
#ifdef UARTC_SUBPRIORITY
  #error Legacy UARTC_SUBPRIORITY used !
#endif
#ifdef UARTC_PRIORITY
#error Legacy UARTC_PRIORITY used !
#endif
#ifndef UARTC_IRQ_PRIORITY
  #define UARTC_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UARTC_IRQn, UARTC_IRQ_PRIORITY);
#endif

#ifdef UARTC_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UARTC_UARTx);
  LL_USART_DisableIT_TC(UARTC_UARTx);
  LL_USART_ClearFlag_TC(UARTC_UARTx);
  // Flush buffer
  uartc_txwritepos = uartc_txreadpos = 0;
#endif

#ifdef UARTC_USE_RX
  // Disable Receive Data register not empty interrupt
  LL_USART_DisableIT_RXNE(UARTC_UARTx);
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UARTC_UARTx);
#endif
  // Flush buffer
  uartc_rxwritepos = uartc_rxreadpos = 0;
#ifdef UARTC_USE_RXERRORCOUNT
  uartc_errorcnt_rxnoise = 0;
  uartc_errorcnt_rxframe = 0;
  uartc_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UARTC_UARTx->CR2, USART_CR2_CLKEN);
  CLEAR_BIT(UARTC_UARTx->CR3, USART_CR3_HDSEL);
#if defined USART_CR2_LINEN
  CLEAR_BIT(UARTC_UARTx->CR2, USART_CR2_LINEN);
#endif
#if defined USART_CR3_SCEN || defined USART_CR3_IREN // assume that always both are defined
  CLEAR_BIT(UARTC_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_IREN));
#endif

